Tsar/smart_home/ESP8266_Firmware/src/main.cpp
bool connectToWiFi(const char* ssid, const char* passphrase, bool connectInfinitely) {
  digitalWrite(LED_BUILTIN, LOW);
  udp.stop();

  WiFi.disconnect(true);
  Serial.printf("Connecting to wi-fi: SSID '%s', passphrase '%s'\n", ssid, passphrase);
  WiFi.begin(ssid, passphrase);

  wifiConnectResult = WiFi.waitForConnectResult(30000);
  while (wifiConnectResult != WL_CONNECTED) {
    if (!connectInfinitely) {
      Serial.printf("Failed to connect, status: %d\n", wifiConnectResult);
      return false;
    }
    Serial.printf("Not yet connected, status: %d\n", wifiConnectResult);
    delay(1000);  // making delay for part of wait, because sometimes waitForConnectResult exits immediately
    wifiConnectResult = WiFi.waitForConnectResult(9000);
  }

  const auto& ip = WiFi.localIP();
  Serial.printf("Connected, IP: %s\n", ip.toString().c_str());
  digitalWrite(LED_BUILTIN, HIGH);

  // This should partly help for quick responses, details: https://github.com/esp8266/Arduino/issues/6886
  experimental::ESP8266WiFiGratuitous::stationKeepAliveSetIntervalMs();

  const bool listeningMulticast = udp.beginMulticast(ip, UDP_MULTICAST_IP, UDP_MULTICAST_PORT);
  if (listeningMulticast) {
    Serial.printf("Started listening UDP multicast on %s:%d\n", UDP_MULTICAST_IP.toString().c_str(), UDP_MULTICAST_PORT);
    rejoinMulticastGroupTicker.detach();
    rejoinMulticastGroupTicker.attach_ms_scheduled(REJOIN_MULTICAST_GROUP_INTERVAL, rejoinMulticastGroup);
  } else {
    Serial.println("Failed to start listening UDP multicast");
  }

  return true;
}

bool checkPassword() {
  if (server.hasHeader("Password") && server.header("Password") == homeCfg.getPassword()) {
    return true;
  }
  server.send(403, "text/plain", "Forbidden");
  Serial.printf("Sent 403 for %s\n", server.uri().c_str());
  return false;
}

void sendBadRequest() {
  server.send(400, "text/plain", "Bad Request");
  Serial.printf("Sent 400 for %s\n", server.uri().c_str());
}

// Create JSON (inefficiently)
String generateInfoJson(bool minimal) {
  String result = "{\n  \"mac\": \"" + WiFi.macAddress() + "\",\n  \"name\": \"" + homeCfg.getName() + "\"";
  if (!minimal) {
    result += ",\n  \"values\": {\n    \"";
    for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
      result += DIMMER_PREFIX + String(i) + "\": " + String(homeCfg.getDimmerValue(i)) + ",\n    \"";
    }
    for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
      result += SWITCHER_PREFIX + String(i) + "\": " + (homeCfg.getSwitcherValue(i) ? "1" : "0") + (i + 1 == SWITCHERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"micros\": {\n    \"";
    for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
      int32_t value = homeCfg.getDimmerValue(i);
      result += DIMMER_PREFIX + String(i) + "\": " + String(value > 0 ? dimmerValueToMicros(value, i) : -1) + (i + 1 == DIMMERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"dimmers_settings\": {\n    \"";
    for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
      result += DIMMER_PREFIX + String(i) + "\": {\n      \"value_change_step\": " + String(dimmersSettings[i].valueChangeStep)
                                              + ",\n      \"min_lightness_micros\": " + String(dimmersSettings[i].minLightnessMicros)
                                              + ",\n      \"max_lightness_micros\": " + String(dimmersSettings[i].maxLightnessMicros)
                                              + "\n    }" + (i + 1 == DIMMERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"switchers_inverted\": {\n    \"";
    for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
      result += SWITCHER_PREFIX + String(i) + "\": " + (homeCfg.isSwitcherInverted(i) ? "1" : "0") + (i + 1 == SWITCHERS_COUNT ? "" : ",\n    \"");
    }
    result += "\n  },\n  \"order\": {\n    \"dimmers\": [0, 1, 2],\n    \"switchers\": [0, 1, 2, 3]\n  }";  // TODO: dynamic order
    const auto currentUptime = millis();
    result += ",\n  \"uptime_ms\": " + String(currentUptime)
            + ",\n  \"input_falls_count\": " + String(inputFallsCount)
            + ",\n  \"average_input_fall_interval_ms\": " + String(static_cast<double>(currentUptime) / inputFallsCount, 5);
  }
  result += "\n}\n";
  return result;
}

class UnalignedBinarySerializer {
public:
  UnalignedBinarySerializer(char* buffer) : buffer_(buffer), pos_(0) {}

  void writeWiFiMacAddress() {
    WiFi.macAddress(reinterpret_cast<uint8_t*>(buffer_ + pos_));
    pos_ += WL_MAC_ADDR_LENGTH;
  }

  void writeUInt8(uint8_t value) {
    buffer_[pos_++] = value;
  }

  void writeUInt16(uint16_t value) {
    memcpy(buffer_ + pos_, &value, 2);
    pos_ += 2;
  }

  void writeString(String value) {
    writeUInt16(value.length());
    memcpy(buffer_ + pos_, value.c_str(), value.length());
    pos_ += value.length();
  }

  size_t getWrittenSize() const {
    return pos_;
  }

private:
  char* buffer_;
  size_t pos_;
};

// Fill binInfoStorage
void generateInfoBinary() {
  const String name = homeCfg.getName();
  const size_t sz = WL_MAC_ADDR_LENGTH        // MAC size
                  + 2 + name.length()         // name length and name size
                  + 1 + DIMMERS_COUNT * 8     // dimmers values size (4 x uint16_t)
                  + 1 + SWITCHERS_COUNT * 2;  // switchers values size (2 x uint8_t)
  binInfoStorage.resize(sz);

  UnalignedBinarySerializer serializer(binInfoStorage.data());
  serializer.writeWiFiMacAddress();
  serializer.writeString(name);
  serializer.writeUInt8(DIMMERS_COUNT);
  for (uint8_t i = 0; i < DIMMERS_COUNT; ++i) {
    serializer.writeUInt16(homeCfg.getDimmerValue(i));
    serializer.writeUInt16(dimmersSettings[i].valueChangeStep);
    serializer.writeUInt16(dimmersSettings[i].minLightnessMicros);
    serializer.writeUInt16(dimmersSettings[i].maxLightnessMicros);
  }
  serializer.writeUInt8(SWITCHERS_COUNT);
  for (uint8_t i = 0; i < SWITCHERS_COUNT; ++i) {
    serializer.writeUInt8(homeCfg.getSwitcherValue(i));
    serializer.writeUInt8(homeCfg.isSwitcherInverted(i));
  }

